# Capstone 1 - Part 2
Author- Sampada Kasture

In the first part of the capstone, we focused on Data Retrieval, Data Preprocessing, Feature Engineering and Exploratory Data Analysis using Python & its
libraries. Now we are going to shift gears and gain insights into our HR Analytics dataset using SQL.
### TODO: Make use of SQL to do the following:
### Create a SQLITE3 DB using the CSV file (2 pts). Please refer this link and this link to know more.
### Calculate the Attrition Rate and summarize attrition (3 pts) by:
1. Gender
2. Department
3. Age
4. Average monthly income by job level
5. Years at company

### Continue using SQL to explore main reasons for attrition (3 pts), For example:
- Why do more people over 50 years old leave the company than people who aged 40-50?
- Why do people with higher pay still leave the company?
- Which factors drive employees who work at company less than 5 years to leave?
###Effective Communication (2 pts)
- Please make use of markdown cells to communicate your thought process, why did you think of performing a step? what was the observation from the
query? etc.
- The code should be commented so that it is readable for the reviewer.
### Grading and Important Instructions
- Each of the above steps are mandatory and should be completed in good faith
- Make sure before submitting that the code is in fully working condition
- It is fine to make use of ChatGPT, stackoverflow type resources, just provide the reference links from where you got it
- Debugging is an art, if you find yourself stuck with errors, take help of stackoverflow and ChatGPT to resolve the issue and if it's still unresolved, reach out
to me for help.
- You need to score atleast 7/10 to pass the project, anything less than that will be marked required, needing resubmission.
- Feedback will be provided on 3 levels (Awesome, Suggestion, & Required). - - Required changes are mandatory to be made.
- For submission, please upload the project on github and share the link to the file with us through LMS

## Importing required libraries

In [19]:
import pandas as pd
import sqlite3

In [20]:
#retrieving database
df = pd.read_csv('https://raw.githubusercontent.com/sampada-kasture/HR_Employee_Attrition/refs/heads/main/CSV_File/HR-Employee-Attrition.csv')
df.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2

## Creating a SQLite3 DB

In [21]:
conn = sqlite3.connect('HR_Employee_Attrition.db')

In [22]:
df.to_sql('attrition', conn, if_exists='replace', index=False)

1470

In [23]:
conn.commit()

In [24]:
import prettytable

prettytable.DEFAULT = prettytable.TableStyle



%load_ext sql
%config SqlMagic.style = 'Default'
%sql sqlite:///HR_Employee_Attrition.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

## Loading data

In [25]:
%%sql

select *
from Attrition
LIMIT 5;

 * sqlite:///HR_Employee_Attrition.db
Done.

[(41, 'Yes', 'Travel_Rarely', 1102, 'Sales', 1, 2, 'Life Sciences', 1, 1, 2, 'Female', 94, 3, 2, 'Sales Executive', 4, 'Single', 5993, 19479, 8, 'Y', 'Yes', 11, 3, 1, 80, 0, 8, 0, 1, 6, 4, 0, 5),
 (49, 'No', 'Travel_Frequently', 279, 'Research & Development', 8, 1, 'Life Sciences', 1, 2, 3, 'Male', 61, 2, 2, 'Research Scientist', 2, 'Married', 5130, 24907, 1, 'Y', 'No', 23, 4, 4, 80, 1, 10, 3, 3, 10, 7, 1, 7),
 (37, 'Yes', 'Travel_Rarely', 1373, 'Research & Development', 2, 2, 'Other', 1, 4, 4, 'Male', 92, 2, 1, 'Laboratory Technician', 3, 'Single', 2090, 2396, 6, 'Y', 'Yes', 15, 3, 2, 80, 0, 7, 3, 3, 0, 0, 0, 0),
 (33, 'No', 'Travel_Frequently', 1392, 'Research & Development', 3, 4, 'Life Sciences', 1, 5, 4, 'Female', 56, 3, 1, 'Research Scientist', 3, 'Married', 2909, 23159, 1, 'Y', 'Yes', 11, 3, 3, 80, 0, 8, 3, 3, 8, 7, 3, 0),
 (27, 'No', 'Travel_Rarely', 591, 'Research & Development', 2, 1, 'Medical', 1, 7, 1, 'Male', 40, 3, 1, 'Laboratory Technician', 2, 'Married', 3468, 16632, 9, 'Y', 'No', 12, 3, 4, 80, 1, 6, 3, 3, 2, 2, 2, 2)]

## Calculating Attrition Rate

In [26]:
%%sql

SELECT
CASE WHEN Attrition = "Yes" THEN "True"
ELSE "False"
END AS Attrition,
COUNT(*) AS Count
FROM Attrition
GROUP BY
  CASE WHEN Attrition = "Yes" THEN "True" ELSE "False" END;

 * sqlite:///HR_Employee_Attrition.db
Done.

[('False', 1233), ('True', 237)]

In [27]:
%%sql

SELECT
CASE WHEN Attrition = "Yes" THEN "True"
ELSE "False"
END AS Attrition,
ROUND(COUNT(*) * 100.0 / (SELECT COUNT(*) FROM Attrition), 1) ||'%' AS Attrition_Rate
FROM Attrition
GROUP BY Attrition
ORDER BY Attrition_Rate ASC;

 * sqlite:///HR_Employee_Attrition.db
Done.

[('True', '16.1%'), ('False', '83.9%')]

## Calculating Attrition by Gender

In [28]:
%%sql
SELECT
  CASE WHEN Attrition = 'Yes' THEN 'True' ELSE 'False' END AS Attrition,
  Gender,
  COUNT(*) AS Count_gender,
  ROUND(COUNT(*) * 100.0 / (
    SELECT COUNT(*) FROM Attrition AS a2
    WHERE a2.Gender = a1.Gender
  ), 1) AS Attrition_by_gender


FROM Attrition AS a1
GROUP BY Attrition, Gender
ORDER BY Attrition_by_gender ASC;

 * sqlite:///HR_Employee_Attrition.db
Done.

[('True', 'Female', 87, 14.8),
 ('True', 'Male', 150, 17.0),
 ('False', 'Male', 732, 83.0),
 ('False', 'Female', 501, 85.2)]

## Calculating Attrition by Department

In [29]:
%%sql
SELECT DISTINCT department, Attrition,
COUNT(*) AS Department_Attrition
FROM Attrition
GROUP BY Department, Attrition;

 * sqlite:///HR_Employee_Attrition.db
Done.

[('Human Resources', 'No', 51),
 ('Human Resources', 'Yes', 12),
 ('Research & Development', 'No', 828),
 ('Research & Development', 'Yes', 133),
 ('Sales', 'No', 354),
 ('Sales', 'Yes', 92)]

## Calculate Attrition by Age

In [30]:
%%sql

SELECT
CASE WHEN Attrition = 'Yes' THEN 'True'
ELSE 'False'
END AS Attrition,
CASE
WHEN Age < 30 THEN 'Under 30'
WHEN Age BETWEEN 30 AND 40 THEN '30-40'
WHEN Age BETWEEN 40 AND 50 THEN '40-50'
WHEN Age >50 THEN 'Over 50'
END AS Age_Group,
COUNT(Age) as num,
ROUND (
  COUNT(*) * 100.0 / (
    SELECT COUNT(*) FROM Attrition AS a1
    WHERE
    CASE
        WHEN a1.Age < 30 THEN 'Under 30'
        WHEN a1.Age BETWEEN 30 AND 40 THEN '30-40'
        WHEN a1.Age BETWEEN 40 AND 50 THEN '40-50'
        WHEN a1.Age >50 THEN 'Over 50'
        END =
        CASE WHEN a2.Age < 30 THEN 'Under 30'
        WHEN a2.Age BETWEEN 30 AND 40 THEN '30-40'
        WHEN a2.Age BETWEEN 40 AND 50 THEN '40-50'
        WHEN a2.Age >50 THEN 'Over 50'
    END), 1) || '%' AS Percentage_by_Age
  FROM Attrition AS a2
  GROUP by Attrition, Age_Group
  ORDER BY Age_Group, Attrition;

 * sqlite:///HR_Employee_Attrition.db
Done.

[('False', '30-40', 585, '86.2%'),
 ('True', '30-40', 94, '13.8%'),
 ('False', '40-50', 288, '89.4%'),
 ('True', '40-50', 34, '10.6%'),
 ('False', 'Over 50', 125, '87.4%'),
 ('True', 'Over 50', 18, '12.6%'),
 ('False', 'Under 30', 235, '72.1%'),
 ('True', 'Under 30', 91, '27.9%')]

## Calculate Attrition by Monthly Income

In [31]:
%%sql

SELECT Department, JobLevel, AVG(MonthlyIncome) AS avg_income,
AVG(CASE WHEN Attrition = 'Yes' THEN MonthlyIncome END) AS attrition_avg_income,
ROUND((AVG(MonthlyIncome) - AVG(CASE WHEN Attrition = 'Yes' THEN MonthlyIncome END)), 2) AS difference
FROM attrition
GROUP BY Department, JobLevel
HAVING difference IS NOT NULL
ORDER BY Department

 * sqlite:///HR_Employee_Attrition.db
Done.

[('Human Resources', 1, 2733.212121212121, 2415.7, 317.51),
 ('Human Resources', 3, 9623.0, 10216.0, -593.0),
 ('Research & Development', 1, 2840.064516129032, 2687.3762376237623, 152.69),
 ('Research & Development', 2, 5291.238434163701, 5372.0, -80.76),
 ('Research & Development', 3, 10170.488372093023, 9503.846153846154, 666.64),
 ('Research & Development', 4, 15634.676470588236, 12169.0, 3465.68),
 ('Research & Development', 5, 19218.51020408163, 19550.0, -331.49),
 ('Sales', 1, 2506.7236842105262, 2373.4375, 133.29),
 ('Sales', 2, 5746.054166666667, 5917.0, -170.95),
 ('Sales', 3, 9282.289156626506, 9202.764705882353, 79.52),
 ('Sales', 4, 15166.264705882353, 13395.75, 1770.51),
 ('Sales', 5, 19088.0, 19334.5, -246.5)]

## Calculate Attrition by years at company

In [32]:
%%sql

SELECT CASE
WHEN YearsAtCompany < 2 THEN 'New Hires'
WHEN YearsAtCompany BETWEEN 2 AND 5 THEN '2-5'
WHEN YearsAtCompany BETWEEN 6 AND 10 THEN '6-10'
WHEN YearsAtCompany BETWEEN 11 AND 20 THEN '11-20'
WHEN YearsAtCompany > 20 THEN 'Over 20'
END AS tenure_years,
COUNT(YearsAtCompany) AS num,
ROUND(COUNT(*) * 100.0 / (SELECT COUNT(*) FROM attrition), 1) || '%' AS percent
FROM attrition
GROUP BY tenure_years
ORDER BY tenure_years

 * sqlite:///HR_Employee_Attrition.db
Done.

[('11-20', 180, '12.2%'),
 ('2-5', 561, '38.2%'),
 ('6-10', 448, '30.5%'),
 ('New Hires', 215, '14.6%'),
 ('Over 20', 66, '4.5%')]

## Why do people over 50 leave compared to 40 - 50

In [33]:
%%sql

SELECT
  CASE
    WHEN Age < 30 THEN 'Under 30'
    WHEN Age BETWEEN 30 AND 39 THEN '30 - 39'
    WHEN Age BETWEEN 40 AND 49 THEN '40 - 49'
    WHEN Age >= 50 THEN 'Over 50'
  END AS Age_Group,

  COUNT(*) AS total_count,
  SUM(CASE WHEN Attrition = 'Yes' THEN 1 ELSE 0 END) AS attrition_count,
  ROUND(100.0 * SUM(CASE WHEN Attrition = 'Yes' THEN 1 ELSE 0 END) / COUNT(*), 1) || '%' AS attrition_rate

FROM attrition
GROUP BY Age_Group
ORDER BY Age_Group;

 * sqlite:///HR_Employee_Attrition.db
Done.

[('30 - 39', 622, 89, '14.3%'),
 ('40 - 49', 349, 34, '9.7%'),
 ('Over 50', 173, 23, '13.3%'),
 ('Under 30', 326, 91, '27.9%')]

## Why do people with higher salary still leave the company

In [34]:
%%sql

SELECT
  CASE
    WHEN MonthlyIncome < 3000 THEN 'Low (<3000)'
    WHEN MonthlyIncome BETWEEN 3000 AND 6000 THEN 'Mid (3000-6000)'
    WHEN MonthlyIncome BETWEEN 6000 AND 10000 THEN 'High (6000-10000)'
    ELSE 'Very High (>10000)'
  END AS Salary_Band,

  COUNT(*) AS total_count,
  SUM(CASE WHEN Attrition = 'Yes' THEN 1 ELSE 0 END) AS attrition_count,
  ROUND(100.0 * SUM(CASE WHEN Attrition = 'Yes' THEN 1 ELSE 0 END) / COUNT(*), 1) || '%' AS attrition_rate

FROM attrition
GROUP BY Salary_Band
ORDER BY attrition_rate DESC;

 * sqlite:///HR_Employee_Attrition.db
Done.

[('Very High (>10000)', 281, 25, '8.9%'),
 ('Low (<3000)', 395, 113, '28.6%'),
 ('Mid (3000-6000)', 519, 66, '12.7%'),
 ('High (6000-10000)', 275, 33, '12.0%')]

## What factors drive attrition among employees who work at company less than 5 years?

In [35]:
%%sql

SELECT
  JobSatisfaction,
  EnvironmentSatisfaction,
  WorkLifeBalance,
  COUNT(*) AS total_count,
  SUM(CASE WHEN Attrition = 'Yes' THEN 1 ELSE 0 END) AS attrition_count,
  ROUND(100.0 * SUM(CASE WHEN Attrition = 'Yes' THEN 1 ELSE 0 END) / COUNT(*), 1) || '%' AS attrition_rate

FROM attrition
WHERE YearsAtCompany < 5
GROUP BY JobSatisfaction
ORDER BY attrition_rate DESC;

 * sqlite:///HR_Employee_Attrition.db
Done.

[(1, 3, 2, 120, 40, '33.3%'),
 (3, 4, 3, 178, 46, '25.8%'),
 (2, 1, 3, 110, 26, '23.6%'),
 (4, 2, 3, 172, 29, '16.9%')]

### References
-Chatgpt, Claude.ai, Stackoverflow, W3Schools